#4) დავალების პირველი პირობა
print("GOA ში ყოველ შემოყვანილ ადამიანზე გეძლევა 100ლარი...")
quantity=int(input("მიუთითეთ რამდენი ადამიანი მოიწვიეთ  GOA ში:  "))
print("თქვენ დაგერიცხებოდათ:  "+str(quantity*100)+" ლარი")

#4) დავალების მეორე პირობა
quantity1=int(input("მიუთითეთ რიცხვი 10 ან 15 რათა გაიგოთ რა თანხა დაგერიცხებოდათ ამ შემთხვევაში:  "))
print("თქვენ დაგერიცხებოდათ:  "+str(quantity1*100)+" ლარი თუ შემოიყვანდით : "+str(quantity1)+" ბავშვს GOA ში")

#4) დავალების მესამე პირობა
print("თუ შენ შმოიყვანდი GOA ში 100 ბავშვს გამოკლებული37 დამატებული 13 და მიღებული ჯამი გამრავლებული 100 გაყოფილი 10 ზე და გამრავლებული 264 ეს თანხაიქნებოდა :>>> "+str(((((100-37)+13)*100)/10)*264)
      +"  ლარი")

