#Names of members of the Gabriel Molodin Squad
squad_members=[
 "გურიკო",
 "თინათინ ზუზაძე",
 "ლუკას ვიშტეცალიუ",
 "გიორგი ლობჟანიძე",
 "ლუკა ათაბეგაშვილი",
 "გიო აბულაძე",
 "თეკლა პაპავა",
 "რეზი ნეფარიძე",
 "დავით ჭილაშვილი",
 "გიო კაციტაძე", 
 "მირიან გელაშვილი", 
 "რატი მურღულია",
 "ნინო სოლომონია",
 "ბექა გიორგობიანი",
 "ბექა ბერაშვილი", 
 "ნინი გოგლიჩაძე",
 "გიორგი ჩხეტიანი",
 "თემო ლაბაძე", 
 "გიორგი მგელაძე",
 "ენური სოლონნიშვილი",
 "დემეტრე ხარატიშვილი", 
 "დავით დემურაძე", 
 "სალომე მილაძე"]
#The middle 5 members of the list should appear on the screen
print(squad_members[9:14])