# შემოიტანეთ აპლიკანტის სიმაღლე (>=160და <=230)  წონა (>=55 და <=130)  ასაკი (>=18 და <=27) თუ აპლიკანტის მონაცემები აკმაყოფილებს შესაბამის მოთხოვნებს 
#"გოლოცავთ! თქვენ ჩაირიცხეთ სავალდებულო სამხედრო სამსახურში "   
#და თუ არ აკმაყოფილებს დაიბეჭდოს "სამწუხაროდ თქვენი მონაცემები არ შეესაბამება ჩვენს მოთხოვნებს"

age=float(input("დაწერთ აპლიკანტის ასაკი:  "))
weight=float(input("დაწერეთ აპლიკანტის წონა კილოგრამებში:  "))
height=float(input("დაწერეთ აპლიკანტის სიმაღელე სანტიმეტრებში:  "))

if age>=18 and age<=27 and weight>=55 and weight<=130 and height>=160 and height<=230:
    print("გოლოცავთ! თქვენ ჩაირიცხეთ სავალდებულო სამხედრო სამსახურში ")
else:
    print("სამწუხაროდ თქვენი მონაცემები არ შეესაბამება ჩვენს მოთხოვნებს")

