#შემოიტანეთ 3 რიცხვი და დაპრინტეთ გამოვა თუ აარა ამ რიცხვებით სამკუთხედი, თუ გამოვა გამოთვალეთ პერიმეტრი და დაპრინტეთ 
#"ამ სამკუთხედის პერიმეტრია:...." თუ არადა და მაშინ დაიპრინოს "მსგავსი სამკუთხედი არ არსებობს"

num1=float(input("მიუთითეთ სამკუთხედის პირველი გვერდის სიგრძე სანტიმეტრებში:  "))
num2=float(input("მიუთითეთ სამკუთხედის მეორე გვერდის სიგრძე სანტიმეტრებში:  "))
num3=float(input("მიუთითეთ სამკუთხედის მესამე გვერდის სიგძე სანტიმეტრებში:  "))
if num1>0 and num2>0 and num3>0:
    print( "თქვენს მიერშეყვანილი მონაცემებით სმდგარი სამკუთხედი არსებობს და მისი პერიმეტრი არის:  "+str(num1+num2+num3)+ "სანტიმეტრი")
else:
    print("თქვენს მიერ შეყვანილი მონაცებეის სამკუთხედი არ არსებობს!")