#მომხმარებელს შეატანინეთ ორი სახელი და გვარი შეადარეთ  ერთი მეორეს, დათვალეთ 'ა' 
#სიმბოლოს რაოდენობა და რომელ სახელშიც მეტი იქნება დაპრინტეთ მიღებული შედეგი

ask=input("#1 დაწერეთ სახელი და გვარი (ქართული შრიფთით) :  ")
ask1=input("#2 დაწერეთ თქვენი მეგობრის სახელი და გვარი (ქართული შრიფთით) : ")

newlist=[]
newlist = [x for x in ask if "ა" in x]
x=len(newlist)


newlist1=[]
newlist1 = [x for x in ask1 if "ა" in x]
y=len(newlist1)

if x>y:
    print(ask+"  შენი სახელი შეიცავს უფო მეტ 'ა' ხმოვანს რის გამოც გაიმარჯვე შენს სახელში 'ა'_ს რაოდენობა არის: "+str(x)+" ხოლო შენი მეგობრის სახელში კი: "+str(y))
elif y>x:
    print("გაიმარჯვა შენი მეგობრის სახელმა  : "+ask1+",  რადგან მის სახელშ არის უფრო მეტი 'ა' სიმბოლო, კერძოდ შენ სახელში არის:  "+str(x)+" ხოლო შენი მეგობრის სახელში კი: "+str(y))
else :
    print("სახელებში სიმბოლო 'ა'_ს რაოდენბოა გახლავთ ერთმანეთის ტოლი, კიდევ სცადეთ სხვა მეგობრის სახელის დაბეჭვდით")
